platformio/platform-atmelavr/misc/svd/attiny85.svd
<device>
  <vendor>Atmel</vendor>
  <name>ATtiny85</name>
  <addressUnitBits>8</addressUnitBits>
  <size>8</size>
  <access>read-write</access>
  <resetValue>0</resetValue>
  <resetMask>0xff</resetMask>
  <peripherals>
    <peripheral>
      <name>AC</name>
      <description>Analog Comparator</description>
      <baseAddress>0x23</baseAddress>
      <registers>
        <register>
          <name>ACSR</name>
          <description>Analog Comparator Control And Status Register</description>
          <addressOffset>0x5</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACIS</name>
              <description>Analog Comparator Interrupt Mode Select</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>ACIS</name><usage>read-write</usage><enumeratedValue><name>ON_TOGGLE</name><description>Interrupt on Toggle</description><value>0</value></enumeratedValue><enumeratedValue><name>ON_FALLING_EDGE</name><description>Interrupt on Falling Edge</description><value>2</value></enumeratedValue><enumeratedValue><name>ON_RISING_EDGE</name><description>Interrupt on Rising Edge</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ACIE</name>
              <description>Analog Comparator Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACI</name>
              <description>Analog Comparator Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACO</name>
              <description>Analog Compare Output</description>
              <bitRange>[5:5]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>ACBG</name>
              <description>Analog Comparator Bandgap Select</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ACD</name>
              <description>Analog Comparator Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRB</name>
          <description>ADC Control and Status Register B</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>ACME</name>
              <description>Analog Comparator Multiplexer Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR0</name>
          <description>Digital Input Disable Register 0</description>
          <addressOffset>0x11</addressOffset>
          <fields>
            <field>
              <name>AIN0D</name>
              <description>AIN0 Digital Input Disable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AIN1D</name>
              <description>AIN1 Digital Input Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>Analog-to-Digital Converter</description>
      <baseAddress>0x23</baseAddress>
      <registers>
        <register>
          <name>ADC</name>
          <description>ADC Data Register  Bytes</description>
          <addressOffset>0x1</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ADCSRA</name>
          <description>ADC Control and Status Register A</description>
          <addressOffset>0x3</addressOffset>
          <fields>
            <field>
              <name>ADPS</name>
              <description>ADC  Prescaler Select Bits</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>ADPS</name><usage>read-write</usage><enumeratedValue><name>PRESCALER_2</name><description>Prescaler Value 2</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALER_4</name><description>Prescaler Value 4</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALER_8</name><description>Prescaler Value 8</description><value>3</value></enumeratedValue><enumeratedValue><name>PRESCALER_16</name><description>Prescaler Value 16</description><value>4</value></enumeratedValue><enumeratedValue><name>PRESCALER_32</name><description>Prescaler Value 32</description><value>5</value></enumeratedValue><enumeratedValue><name>PRESCALER_64</name><description>Prescaler Value 64</description><value>6</value></enumeratedValue><enumeratedValue><name>PRESCALER_128</name><description>Prescaler Value 128</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADIE</name>
              <description>ADC Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADIF</name>
              <description>ADC Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADATE</name>
              <description>ADC Auto Trigger Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADSC</name>
              <description>ADC Start Conversion</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADEN</name>
              <description>ADC Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRB</name>
          <description>ADC Control and Status Register B</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>ADTS</name>
              <description>ADC Auto Trigger Sources</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>ADTS</name><usage>read-write</usage><enumeratedValue><name>FREE</name><description>Free Running mode</description><value>0</value></enumeratedValue><enumeratedValue><name>AC</name><description>Analog Comparator</description><value>1</value></enumeratedValue><enumeratedValue><name>INT0</name><description>External Interrupt Request 0</description><value>2</value></enumeratedValue><enumeratedValue><name>TC0_CMA</name><description>Timer/Counter0 Compare Match A</description><value>3</value></enumeratedValue><enumeratedValue><name>TC0_OVF</name><description>Timer/Counter0 Overflow</description><value>4</value></enumeratedValue><enumeratedValue><name>TC0_CMB</name><description>Timer/Counter0 Compare Match B</description><value>5</value></enumeratedValue><enumeratedValue><name>PCIR</name><description>Pin Change Interrupt Request</description><value>6</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IPR</name>
              <description>Input Polarity Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BIN</name>
              <description>Bipolar Input Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMUX</name>
          <description>The ADC multiplexer Selection Register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>MUX</name>
              <description>Analog Channel and Gain Selection Bits</description>
              <bitRange>[3:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues><name>MUX</name><usage>read-write</usage><enumeratedValue><name>ADC0</name><description>Single-ended Input ADC0</description><value>0</value></enumeratedValue><enumeratedValue><name>ADC1</name><description>Single-ended Input ADC1</description><value>1</value></enumeratedValue><enumeratedValue><name>ADC2</name><description>Single-ended Input ADC2</description><value>2</value></enumeratedValue><enumeratedValue><name>ADC3</name><description>Single-ended Input ADC3</description><value>3</value></enumeratedValue><enumeratedValue><name>ADC2_ADC2_1X</name><description>Differential Inputs Positive ADC2 Negative ADC2 1x Gain</description><value>4</value></enumeratedValue><enumeratedValue><name>ADC2_ADC2_20X</name><description>Differential Inputs Positive ADC2 Negative ADC2 20x Gain</description><value>5</value></enumeratedValue><enumeratedValue><name>ADC2_ADC3_1X</name><description>Differential Inputs Positive ADC2 Negative ADC3 1x Gain</description><value>6</value></enumeratedValue><enumeratedValue><name>ADC2_ADC3_20X</name><description>Differential Inputs Positive ADC2 Negative ADC3 20x Gain</description><value>7</value></enumeratedValue><enumeratedValue><name>ADC0_ADC0_1X</name><description>Differential Inputs Positive ADC0 Negative ADC0 1x Gain</description><value>8</value></enumeratedValue><enumeratedValue><name>ADC0_ADC0_20X</name><description>Differential Inputs Positive ADC0 Negative ADC0 20x Gain</description><value>9</value></enumeratedValue><enumeratedValue><name>ADC0_ADC1_1X</name><description>Differential Inputs Positive ADC0 Negative ADC1 1x Gain</description><value>10</value></enumeratedValue><enumeratedValue><name>ADC0_ADC1_20X</name><description>Differential Inputs Positive ADC0 Negative ADC1 20x Gain</description><value>11</value></enumeratedValue><enumeratedValue><name>ADC_VBG</name><description>Internal Reference (VBG)</description><value>12</value></enumeratedValue><enumeratedValue><name>ADC_GND</name><description>0V (GND)</description><value>13</value></enumeratedValue><enumeratedValue><name>TEMPSENS</name><description>Temperature sensor</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>REFS2</name>
              <description>Reference Selection Bit 2</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADLAR</name>
              <description>Left Adjust Result</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>REFS</name>
              <description>Reference Selection Bits</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues><name>REFS</name><usage>read-write</usage><enumeratedValue><name>VCC</name><description>Vcc used as Voltage Reference, disconnected from Aref</description><value>0</value></enumeratedValue><enumeratedValue><name>AREF</name><description>External Voltage Reference at AREF pin, Internal Voltage Reference turned off</description><value>1</value></enumeratedValue><enumeratedValue><name>INTERNAL</name><description>Internal Voltage Reference (1.1V when REFS2 is cleared, 2.56V when REFS2 is set) without external bypass</description><value>2</value></enumeratedValue><enumeratedValue><name>INTERNAL_BYPASS</name><description>Internal 2.56V Voltage Reference with external bypass capacitor at AREF pin (REFS2 must be set)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR0</name>
          <description>Digital Input Disable Register 0</description>
          <addressOffset>0x11</addressOffset>
          <fields>
            <field>
              <name>ADC1D</name>
              <description>ADC1 Digital input Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC3D</name>
              <description>ADC3 Digital input Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC2D</name>
              <description>ADC2 Digital input Disable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC0D</name>
              <description>ADC0 Digital input Disable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
