platformio/platform-atmelavr/misc/svd/attiny85.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BOOT_LOAD</name>
      <description>Bootloader</description>
      <baseAddress>0x57</baseAddress>
      <registers>
        <register>
          <name>SPMCSR</name>
          <description>Store Program Memory Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SPMEN</name>
              <description>Store Program Memory Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PGERS</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PGWRT</name>
              <description>Page Write</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RFLB</name>
              <description>Read fuse and lock bits</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CTPB</name>
              <description>Clear temporary page buffer</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RSIG</name>
              <description>Read Device Signature Imprint Table</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU Registers</description>
      <baseAddress>0x31</baseAddress>
      <interrupt>
        <name>RESET</name>
        <description>External Pin, Power-on Reset, Brown-out Reset,Watchdog Reset</description>
      <value>0</value>
        </interrupt>
      <interrupt>
        <name>INT0</name>
        <description>External Interrupt 0</description>
      <value>1</value>
        </interrupt>
      <interrupt>
        <name>PCINT0</name>
        <description>Pin change Interrupt Request 0</description>
      <value>2</value>
        </interrupt>
      <interrupt>
        <name>TIMER1_COMPA</name>
        <description>Timer/Counter1 Compare Match 1A</description>
      <value>3</value>
        </interrupt>
      <interrupt>
        <name>TIMER1_OVF</name>
        <description>Timer/Counter1 Overflow</description>
      <value>4</value>
        </interrupt>
      <interrupt>
        <name>TIMER0_OVF</name>
        <description>Timer/Counter0 Overflow</description>
      <value>5</value>
        </interrupt>
      <interrupt>
        <name>EE_RDY</name>
        <description>EEPROM Ready</description>
      <value>6</value>
        </interrupt>
      <interrupt>
        <name>ANA_COMP</name>
        <description>Analog comparator</description>
      <value>7</value>
        </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>ADC Conversion ready</description>
      <value>8</value>
        </interrupt>
      <interrupt>
        <name>TIMER1_COMPB</name>
        <description>Timer/Counter1 Compare Match B</description>
      <value>9</value>
        </interrupt>
      <interrupt>
        <name>TIMER0_COMPA</name>
        <description>Timer/Counter0 Compare Match A</description>
      <value>10</value>
        </interrupt>
      <interrupt>
        <name>TIMER0_COMPB</name>
        <description>Timer/Counter0 Compare Match B</description>
      <value>11</value>
        </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>Watchdog Time-out</description>
      <value>12</value>
        </interrupt>
      <interrupt>
        <name>USI_START</name>
        <description>USI START</description>
      <value>13</value>
        </interrupt>
      <interrupt>
        <name>USI_OVF</name>
        <description>USI Overflow</description>
      <value>14</value>
        </interrupt>
    <registers>
        <register>
          <name>CLKPR</name>
          <description>Clock Prescale Register</description>
          <addressOffset>0x15</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKPS</name>
              <description>Clock Prescaler Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>CLKPS</name><usage>read-write</usage><enumeratedValue><name>PRESCALER_1</name><description>Prescaler Value 1</description><value>0</value></enumeratedValue><enumeratedValue><name>PRESCALER_2</name><description>Prescaler Value 2</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALER_4</name><description>Prescaler Value 4</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALER_8</name><description>Prescaler Value 8</description><value>3</value></enumeratedValue><enumeratedValue><name>PRESCALER_16</name><description>Prescaler Value 16</description><value>4</value></enumeratedValue><enumeratedValue><name>PRESCALER_32</name><description>Prescaler Value 32</description><value>5</value></enumeratedValue><enumeratedValue><name>PRESCALER_64</name><description>Prescaler Value 64</description><value>6</value></enumeratedValue><enumeratedValue><name>PRESCALER_128</name><description>Prescaler Value 128</description><value>7</value></enumeratedValue><enumeratedValue><name>PRESCALER_256</name><description>Prescaler Value 256</description><value>8</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CLKPCE</name>
              <description>Clock Prescaler Change Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DWDR</name>
          <description>debugWire data register</description>
          <addressOffset>0x11</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPIOR0</name>
          <description>General purpose register 0</description>
          <addressOffset>0x0</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPIOR1</name>
          <description>General Purpose register 1</description>
          <addressOffset>0x1</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPIOR2</name>
          <description>General Purpose IO register 2</description>
          <addressOffset>0x2</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>SM</name>
              <description>Sleep Mode Select Bits</description>
              <bitRange>[4:3]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC Noise Reduction (If Available)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDOWN</name>
                  <description>Power Down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SE</name>
              <description>Sleep Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PUD</name>
              <description>Pull-up Disable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          <field><name>BODS</name><description>BOD Sleep (available on some devices)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>BODSE</name><description>BOD Sleep Enable (available on some devices)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields>
        </register>
        <register>
          <name>MCUSR</name>
          <description>MCU Status register</description>
          <addressOffset>0x23</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PORF</name>
              <description>Power-On Reset Flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EXTRF</name>
              <description>External Reset Flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BORF</name>
              <description>Brown-out Reset Flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WDRF</name>
              <description>Watchdog Reset Flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCAL</name>
          <description>Oscillator Calibration Register</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OSCCAL</name>
              <description>Oscillator Calibration </description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCSR</name>
          <description>PLL Control and status register</description>
          <addressOffset>0x16</addressOffset>
          <fields>
            <field>
              <name>PLOCK</name>
              <description>PLL Lock detector</description>
              <bitRange>[0:0]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>PLLE</name>
              <description>PLL Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PCKE</name>
              <description>PCK Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LSM</name>
              <description>Low speed mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRR</name>
          <description>Power Reduction Register</description>
          <addressOffset>0xF</addressOffset>
          <fields>
            <field>
              <name>PRADC</name>
              <description>Power Reduction ADC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PRUSI</name>
              <description>Power Reduction USI</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PRTIM0</name>
              <description>Power Reduction Timer/Counter0</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PRTIM1</name>
              <description>Power Reduction Timer/Counter1</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
