platformio/platform-atmelavr/misc/svd/attiny85.svd
      </registers>
      </peripheral>
    <peripheral>
      <name>EEPROM</name>
      <description>EEPROM</description>
      <baseAddress>0x3C</baseAddress>
      <registers>
        <register>
          <name>EEAR</name>
          <description>EEPROM Address Register  Bytes</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>EECR</name>
          <description>EEPROM Control Register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EERE</name>
              <description>EEPROM Read Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EEPE</name>
              <description>EEPROM Write Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EEMPE</name>
              <description>EEPROM Master Write Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EERIE</name>
              <description>EEPROM Ready Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EEPM</name>
              <description>EEPROM Programming Mode Bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>EEPM</name><usage>read-write</usage><enumeratedValue><name>ATOMIC</name><description>Atomic (erase and write in one operation)</description><value>0</value></enumeratedValue><enumeratedValue><name>ERASE</name><description>Erase only</description><value>1</value></enumeratedValue><enumeratedValue><name>WRITE</name><description>Write only</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDR</name>
          <description>EEPROM Data Register</description>
          <addressOffset>0x1</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>External Interrupts</description>
      <baseAddress>0x35</baseAddress>
      <registers>
        <register>
          <name>GIFR</name>
          <description>General Interrupt Flag register</description>
          <addressOffset>0x25</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIF</name>
              <description>Pin Change Interrupt Flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>INTF0</name>
              <description>External Interrupt Flag 0</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GIMSK</name>
          <description>General Interrupt Mask Register</description>
          <addressOffset>0x26</addressOffset>
          <fields>
            <field>
              <name>PCIE</name>
              <description>Pin Change Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>INT0</name>
              <description>External Interrupt Request 0 Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field><name>ISC0</name><description>Interrupt Sense Control 0 bits</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><name>ISC0</name><usage>read-write</usage><enumeratedValue><name>LOW</name><description>The low level of INTx generates an interrupt request</description><value>0</value></enumeratedValue><enumeratedValue><name>TOGGLE</name><description>Any logical change on INTx generates an interrupt request</description><value>1</value></enumeratedValue><enumeratedValue><name>FALLING</name><description>The falling edge of INTx generates an interrupt request</description><value>2</value></enumeratedValue><enumeratedValue><name>RISING</name><description>The rising edge of INTx generates an interrupt request</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            </fields>
        </register>
        <register>
          <name>PCMSK</name>
          <description>Pin Change Enable Mask</description>
          <addressOffset>0x0</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x0</baseAddress>
      <registers>
        <register>
          <name>EXTENDED</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>SELFPRGEN</name>
              <description>Self Programming enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>BODLEVEL</name>
              <description>Brown-out Detector trigger level</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>Brown-out detection at VCC=4.3 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V7</name>
                  <description>Brown-out detection at VCC=2.7 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V8</name>
                  <description>Brown-out detection at VCC=1.8 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Brown-out detection disabled</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EESAVE</name>
              <description>Preserve EEPROM through the Chip Erase cycle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDTON</name>
              <description>Watch-dog Timer always on</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPIEN</name>
              <description>Serial program downloading (SPI) enabled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DWEN</name>
              <description>Debug Wire enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RSTDISBL</name>
              <description>Reset Disabled (Enable PB5 as i/o pin)</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SUT_CKSEL</name>
              <description>Select Clock source</description>
              <bitRange>[5:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTCLK_6CK_14CK_0MS</name>
                  <description>Ext. Clock; Start-up time PWRDWN/RESET: 6 CK/14 CK + 0 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCLK_1KCK_14CK_4MS</name>
                  <description>PLL Clock; Start-up time PWRDWN/RESET: 1K CK/14 CK + 4 ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_14CK_0MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 0 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6MHZ4_6CK_14CK_64MS</name>
                  <description>ATtiny15 Comp: Int. RC Osc. 6.4 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOSC_128KHZ_6CK_14CK_0MS</name>
                  <description>WD. Osc. 128 kHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 0 ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_14CK_0MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time PWRDWN/RESET: 1K CK/14 CK + 0 ms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_258CK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 4.1 ms</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 65 ms</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_258CK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 4.1 ms</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 65 ms</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_258CK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 4.1 ms</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 65 ms</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_258CK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 4.1 ms</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_1KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 65 ms</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_14CK_4MS1</name>
                  <description>Ext. Clock; Start-up time PWRDWN/RESET: 6 CK/14 CK + 4.1 ms</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCLK_16KCK_14CK_4MS</name>
                  <description>PLL Clock; Start-up time PWRDWN/RESET: 16K CK/14 CK + 4 ms</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_14CK_4MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 4 ms</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOSC_128KHZ_6CK_14CK_4MS</name>
                  <description>WD. Osc. 128 kHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 4 ms</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_14CK_4MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time PWRDWN/RESET: 1K CK/14 CK + 4 ms</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_258CK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 65 ms</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_16KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 0 ms</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_258CK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 65 ms</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_16KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 0 ms</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_258CK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 65 ms</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_16KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 0 ms</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_258CK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 65 ms</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_16KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 0 ms</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_14CK_65MS</name>
                  <description>Ext. Clock; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCLK_1KCK_14CK_64MS</name>
                  <description>PLL Clock; Start-up time PWRDWN/RESET: 1K CK/14 CK + 64 ms</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_14CK_64MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6MHZ4_6CK_14CK_4MS</name>
                  <description>ATtiny15 Comp: Int. RC Osc. 6.4 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 4 ms</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOSC_128KHZ_6CK_14CK_64MS</name>
                  <description>WD. Osc. 128 kHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_14CK_64MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time PWRDWN/RESET: 32K CK/14 CK + 64 ms</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 0 ms</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_16KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 4.1 ms</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 0 ms</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_16KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 4.1 ms</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 0 ms</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_16KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 4.1 ms</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_1KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 0 ms</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_16KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 4.1 ms</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCLK_16KCK_14CK_64MS</name>
                  <description>PLL Clock; Start-up time PWRDWN/RESET: 16K CK/14 CK + 64 ms</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6MHZ4_1CK_14CK_0MS</name>
                  <description>ATtiny15 Comp: Int. RC Osc. 6.4 MHz; Start-up time PWRDWN/RESET: 1 CK/14 CK + 0 ms</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 4.1 ms</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_16KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 4.1 ms</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_16KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 4.1 ms</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_16KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_1KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 4.1 ms</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_16KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKOUT</name>
              <description>Clock output on PORTB4</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CKDIV8</name>
              <description>Divide clock by 8 internally</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
