platformio/platform-atmelavr/misc/svd/attiny85.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC1</name>
      <description>Timer/Counter1, 8-bit</description>
      <baseAddress>0x43</baseAddress>
      <registers>
        <register>
          <name>DT1A</name>
          <description>Dead Time Value Register A</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>DTVL</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[3:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DTVH</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[7:4]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DT1B</name>
          <description>Dead Time Value Register B</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>DTVL</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[3:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DTVH</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[7:4]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DTPS</name>
          <description>Dead time prescaler register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DTPS</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            <enumeratedValues><name>DTPS</name><usage>read-write</usage><enumeratedValue><name>DIRECT</name><description>No Prescaling</description><value>0</value></enumeratedValue><enumeratedValue><name>PRESCALE_2</name><description>Division factor 2</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALE_4</name><description>Division factor 4</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALE_8</name><description>Division factor 8</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTCCR</name>
          <description>Timer counter control register</description>
          <addressOffset>0x9</addressOffset>
          <fields>
            <field>
              <name>PSR1</name>
              <description>Prescaler Reset Timer/Counter1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FOC1A</name>
              <description>Force Output Compare 1A</description>
              <bitRange>[2:2]</bitRange>
            <access>write-only</access></field>
            <field>
              <name>FOC1B</name>
              <description>Force Output Compare Match 1B</description>
              <bitRange>[3:3]</bitRange>
            <access>write-only</access></field>
            <field>
              <name>COM1B</name>
              <description>Comparator B Output Mode</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            <enumeratedValues><name>COM1B</name><usage>read-write</usage><enumeratedValue><name>DISCONNECTED</name><description>Normal port operation, OCix disconnected</description><value>0</value></enumeratedValue><enumeratedValue><name>MATCH_TOGGLE</name><description>Toggle OCix on Compare Match</description><value>1</value></enumeratedValue><enumeratedValue><name>MATCH_CLEAR</name><description>Clear OCix on Compare Match</description><value>2</value></enumeratedValue><enumeratedValue><name>MATCH_SET</name><description>Set OCix on Compare Match</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PWM1B</name>
              <description>Pulse Width Modulator B Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR1A</name>
          <description>Output Compare Register A</description>
          <addressOffset>0xB</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1B</name>
          <description>Output Compare Register B</description>
          <addressOffset>0x8</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1C</name>
          <description>Output Compare Register C</description>
          <addressOffset>0xA</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR1</name>
          <description>Timer/Counter Control Register</description>
          <addressOffset>0xD</addressOffset>
          <fields>
            <field>
              <name>CS1</name>
              <description>Clock Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>CS1</name><usage>read-write</usage><enumeratedValue><name>NO_CLOCK</name><description>No clock source (Timer/Counter stopped)</description><value>0</value></enumeratedValue><enumeratedValue><name>DIRECT</name><description>Running, No Prescaling</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALE_2</name><description>Running, CLK/2</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALE_4</name><description>Running, CLK/4</description><value>3</value></enumeratedValue><enumeratedValue><name>PRESCALE_8</name><description>Running, CLK/8</description><value>4</value></enumeratedValue><enumeratedValue><name>PRESCALE_16</name><description>Running, CLK/16</description><value>5</value></enumeratedValue><enumeratedValue><name>PRESCALE_32</name><description>Running, CLK/32</description><value>6</value></enumeratedValue><enumeratedValue><name>PRESCALE_64</name><description>Running, CLK/64</description><value>7</value></enumeratedValue><enumeratedValue><name>PRESCALE_128</name><description>Running, CLK/128</description><value>8</value></enumeratedValue><enumeratedValue><name>PRESCALE_256</name><description>Running, CLK/256</description><value>9</value></enumeratedValue><enumeratedValue><name>PRESCALE_512</name><description>Running, CLK/512</description><value>10</value></enumeratedValue><enumeratedValue><name>PRESCALE_1024</name><description>Running, CLK/1024</description><value>11</value></enumeratedValue><enumeratedValue><name>PRESCALE_2048</name><description>Running, CLK/2048</description><value>12</value></enumeratedValue><enumeratedValue><name>PRESCALE_4096</name><description>Running, CLK/4096</description><value>13</value></enumeratedValue><enumeratedValue><name>PRESCALE_8192</name><description>Running, CLK/8192</description><value>14</value></enumeratedValue><enumeratedValue><name>PRESCALE_16384</name><description>Running, CLK/16384</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COM1A</name>
              <description>Compare Output Mode, Bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>COM1A</name><usage>read-write</usage><enumeratedValue><name>DISCONNECTED</name><description>Normal port operation, OCix disconnected</description><value>0</value></enumeratedValue><enumeratedValue><name>MATCH_TOGGLE</name><description>Toggle OCix on Compare Match</description><value>1</value></enumeratedValue><enumeratedValue><name>MATCH_CLEAR</name><description>Clear OCix on Compare Match</description><value>2</value></enumeratedValue><enumeratedValue><name>MATCH_SET</name><description>Set OCix on Compare Match</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PWM1A</name>
              <description>Pulse Width Modulator Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CTC1</name>
              <description>Clear Timer/Counter on Compare Match</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT1</name>
          <description>Timer/Counter Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR</name>
          <description>Timer/Counter Interrupt Flag Register</description>
          <addressOffset>0x15</addressOffset>
          <fields>
            <field>
              <name>TOV1</name>
              <description>Timer/Counter1 Overflow Flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OCF1B</name>
              <description>Timer/Counter1 Output Compare Flag 1B</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OCF1A</name>
              <description>Timer/Counter1 Output Compare Flag 1A</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK</name>
          <description>Timer/Counter Interrupt Mask Register</description>
          <addressOffset>0x16</addressOffset>
          <fields>
            <field>
              <name>TOIE1</name>
              <description>Timer/Counter1 Overflow Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OCIE1B</name>
              <description>OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OCIE1A</name>
              <description>OCIE1A: Timer/Counter1 Output Compare Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
