platformio/platform-atmelavr/misc/svd/attiny85.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USI</name>
      <description>Universal Serial Interface</description>
      <baseAddress>0x2D</baseAddress>
      <registers>
        <register>
          <name>USIBR</name>
          <description>USI Buffer Register</description>
          <addressOffset>0x3</addressOffset>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>USICR</name>
          <description>USI Control Register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>USITC</name>
              <description>Toggle Clock Port Pin</description>
              <bitRange>[0:0]</bitRange>
            <access>write-only</access></field>
            <field>
              <name>USICLK</name>
              <description>Clock Strobe</description>
              <bitRange>[1:1]</bitRange>
            <access>write-only</access></field>
            <field>
              <name>USICS</name>
              <description>USI Clock Source Select Bits</description>
              <bitRange>[3:2]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            <enumeratedValues><name>USICS</name><usage>read-write</usage><enumeratedValue><name>NO_CLOCK</name><description>No Clock/Software clock strobe</description><value>0</value></enumeratedValue><enumeratedValue><name>TC0</name><description>Timer/Counter0 Compare Match</description><value>1</value></enumeratedValue><enumeratedValue><name>EXT_POS</name><description>External, positive edge</description><value>2</value></enumeratedValue><enumeratedValue><name>EXT_NEG</name><description>External, negative edge</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>USIWM</name>
              <description>USI Wire Mode Bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>USIWM</name><usage>read-write</usage><enumeratedValue><name>DISABLED</name><description>All detectors disabled. Port pins operates as normal.</description><value>0</value></enumeratedValue><enumeratedValue><name>THREE_WIRE</name><description>Three-wire mode. Uses DO, DI, and USCK pins.</description><value>1</value></enumeratedValue><enumeratedValue><name>TWO_WIRE_SLAVE</name><description>Two-wire mode (Slave). Uses SDA (DI) and SCL (USCK) pins.</description><value>2</value></enumeratedValue><enumeratedValue><name>TWO_WIRE_MASTER</name><description>Two-wire mode (Master). Uses SDA and SCL pins.</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>USIOIE</name>
              <description>Counter Overflow Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USISIE</name>
              <description>Start Condition Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USIDR</name>
          <description>USI Data Register</description>
          <addressOffset>0x2</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>USISR</name>
          <description>USI Status Register</description>
          <addressOffset>0x1</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>USICNT</name>
              <description>USI Counter Value Bits</description>
              <bitRange>[3:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USIDC</name>
              <description>Data Output Collision</description>
              <bitRange>[4:4]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>USIPF</name>
              <description>Stop Condition Flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USIOIF</name>
              <description>Counter Overflow Interrupt Flag</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USISIF</name>
              <description>Start Condition Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watchdog Timer</description>
      <baseAddress>0x41</baseAddress>
      <registers>
        <register>
          <name>WDTCR</name>
          <description>Watchdog Timer Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WDE</name>
              <description>Watch Dog Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDCE</name>
              <description>Watchdog Change Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>WDIE</name>
              <description>Watchdog Timeout Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WDIF</name>
              <description>Watchdog Timeout Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
            </field>
          <field><name>WDPL</name><description>Watchdog Timer Prescaler - Low Bits</description><bitRange>[2:0]</bitRange><enumeratedValues><name>WDPL</name><usage>read-write</usage><enumeratedValue><name>CYCLES_2K_512K</name><description>- 2048 cycles, ~16ms/512K (524288) cycles, ~4s if WDPH is set</description><value>0</value></enumeratedValue><enumeratedValue><name>CYCLES_4K_1024K</name><description>- 4096 cycles, ~32ms/1024K (1048576) cycles, ~8s if WDPH is set</description><value>1</value></enumeratedValue><enumeratedValue><name>CYCLES_8K</name><description>- 8192 cycles, ~64ms</description><value>2</value></enumeratedValue><enumeratedValue><name>CYCLES_16K</name><description>- 16K (16384) cycles, ~0.125s</description><value>3</value></enumeratedValue><enumeratedValue><name>CYCLES_32K</name><description>- 32K (32768) cycles, ~0.25s</description><value>4</value></enumeratedValue><enumeratedValue><name>CYCLES_64K</name><description>- 64K (65536) cycles, ~0.5s</description><value>5</value></enumeratedValue><enumeratedValue><name>CYCLES_128K</name><description>- 128K (131072) cycles, ~1s</description><value>6</value></enumeratedValue><enumeratedValue><name>CYCLES_256K</name><description>- 256K (262144) cycles, ~2s</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>WDPH</name><description>Watchdog Timer Prescaler - High Bit</description><bitRange>[5:5]</bitRange></field>
            </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>